/**
 * 生成日時: 2026/2/18 14:41:33
 * 種類: ノーマルガチャ
 */

const gachaMaster = {
    "0": {
        "name": "にゃんこ",
        "rarityRates": { "0": 0, "1": 7500, "2": 2000, "3": 500, "4": 0 },
        "pool": [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 1000, 1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008 ]
    },
    "62": {
        "name": "福引",
        "rarityRates": { "0": 0, "1": 7400, "2": 2100, "3": 500, "4": 0 },
        "pool": [ 313, 312, 311, 247, 246, 245, 211, 210, 209, 2000, 2000, 2000, 2001, 2002, 2003, 2003, 2004, 2005, 2011, 2011, 2011, 2012, 2012, 2012 ]
    },
    "63": {
        "name": "福引G",
        "rarityRates": { "0": 0, "1": 5100, "2": 3500, "3": 1400, "4": 0 },
        "pool": [ 2057, 2057, 2057, 2017, 2056, 2056, 2056, 2019, 2055, 2055, 2055, 2078, 2078, 2078 ]
    },
    "64": {
        "name": "にゃんこ+",
        "rarityRates": { "0": 10000, "1": 0, "2": 0, "3": 0, "4": 0 },
        "pool": [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 643, 1000, 1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008 ]
    },
    "65": {
        "name": "猫目",
        "rarityRates": { "0": 500, "1": 6900, "2": 2000, "3": 500, "4": 100 },
        "pool": [ 2010, 2011, 2012, 2014, 2050, 2051, 2052, 2053, 2058 ]
    }
};

const itemMaster = {
    "0": { "name": "ネコ", "rarity": 1 },
    "1": { "name": "タンクネコ", "rarity": 1 },
    "2": { "name": "バトルネコ", "rarity": 1 },
    "3": { "name": "キモネコ", "rarity": 1 },
    "4": { "name": "ウシネコ", "rarity": 1 },
    "5": { "name": "ネコノトリ", "rarity": 1 },
    "6": { "name": "ネコフィッシュ", "rarity": 1 },
    "7": { "name": "ネコトカゲ", "rarity": 1 },
    "8": { "name": "巨神ネコ", "rarity": 1 },
    "209": { "name": "ちびネコ", "rarity": 1 },
    "210": { "name": "ちびタンク", "rarity": 1 },
    "211": { "name": "ちびバトル", "rarity": 1 },
    "245": { "name": "ちびキモネコ", "rarity": 1 },
    "246": { "name": "ちびウシネコ", "rarity": 1 },
    "247": { "name": "ちびトリ", "rarity": 1 },
    "311": { "name": "ちびフィッシュ", "rarity": 1 },
    "312": { "name": "ちびトカゲ", "rarity": 1 },
    "313": { "name": "ちび巨神", "rarity": 1 },
    "643": { "name": "ネコ超人", "rarity": 1 },
    "1000": { "name": "砲攻撃力", "rarity": 1 },
    "1001": { "name": "砲チャージ", "rarity": 1 },
    "1002": { "name": "仕事効率", "rarity": 1 },
    "1003": { "name": "お財布", "rarity": 1 },
    "1004": { "name": "お城体力", "rarity": 1 },
    "1005": { "name": "研究力", "rarity": 1 },
    "1006": { "name": "会計力", "rarity": 1 },
    "1007": { "name": "勉強力", "rarity": 1 },
    "1008": { "name": "統率力", "rarity": 1 },
    "2000": { "name": "スピダ", "rarity": 1 },
    "2001": { "name": "トレレ", "rarity": 3 },
    "2002": { "name": "ネコボン", "rarity": 2 },
    "2003": { "name": "ニャンピュ", "rarity": 1 },
    "2004": { "name": "おかめ", "rarity": 2 },
    "2005": { "name": "スニャ", "rarity": 2 },
    "2010": { "name": "5千XP", "rarity": 0 },
    "2011": { "name": "1万XP", "rarity": 1 },
    "2012": { "name": "3万XP", "rarity": 1 },
    "2014": { "name": "10万XP", "rarity": 1 },
    "2017": { "name": "100万XP", "rarity": 3 },
    "2019": { "name": "50万XP", "rarity": 2 },
    "2050": { "name": "EX猫目", "rarity": 1 },
    "2051": { "name": "レア猫目", "rarity": 1 },
    "2052": { "name": "激レア猫目", "rarity": 2 },
    "2053": { "name": "超激猫目", "rarity": 3 },
    "2055": { "name": "ビタンA", "rarity": 1 },
    "2056": { "name": "ビタンB", "rarity": 2 },
    "2057": { "name": "ビタンC", "rarity": 3 },
    "2058": { "name": "闇猫目", "rarity": 4 },
    "2078": { "name": "10万XP", "rarity": 1 }
};

if (typeof module !== 'undefined') { module.exports = { gachaMaster, itemMaster }; }